templates/base_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    allBoundary
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    top
    {
        type symmetry;
    }

    vessel
    {
        type fixedValue;
        value uniform (0 0 0);
    }

    impeller
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}
// ************************************************************************* //
